INPUT_TAG_MAP = {
    'LOCATION': 'LOC',
    'PERSON': 'PER',
}

TAG_MAP = {
    'COUNTRY': 'DMN_COUNTRY',
    'REGION': 'DMN_REGION',
    'CITY': 'DMN_CITY',
    'DISTRICT': 'DMN_DISTRICT',
    'STREET': 'DMN_STREET',
    'HOUSE': 'DMN_HOUSE',
    'LAST_NAME': 'DMN_LAST_NAME',
    'FIRST_NAME': 'DMN_FIRST_NAME',
    'MIDDLE_NAME': 'DMN_MIDDLE_NAME',
}

NOT_NER_TAG = {
    'LAST_NAME': [],
    'FIRST_NAME': [],
    'MIDDLE_NAME': [],
    'COUNTRY': [],
    'REGION': ['республика', 'республике', 'республикою', 'республику', 'республикой', 'республики', 'область',
               'областью', 'области', 'ао', 'автономная', 'автономною', 'автономную', 'автономный', 'автономному',
               'автономного', 'автономным', 'автономное', 'автономном', 'округ', 'округе', 'округом', 'округа',
               'округу', 'край', 'краем', 'краю', 'края', 'крае' 'народная', 'народным', 'народною', 'народной',
               'народного', 'народное', 'народный', 'народную', 'народному'],
    'CITY': ['г.'],
    'DISTRICT': ['район', 'районом', 'района', 'району', 'районе'],
    'STREET': ['улица', 'улицею', 'улицы', 'улицу', 'улицей', 'улице', 'переулок', 'переулком', 'переулку', 'переулке',
               'переулка', 'проезд', 'проезде', 'проезду', 'проездом', 'проезда', 'площадь', 'площадью', 'площадь',
               'площади' 'микрорайон', 'микрорайона', 'микрорайоном', 'микрорайону', 'микрорайоне', 'проспект',
               'проспектом', 'проспекта', 'проспекте', 'проспекту', 'тупик', 'тупике', 'тупику', 'тупика', 'тупиком',
               'бульвар', 'бульваром', 'бульваре', 'бульвару', 'набережная', 'набережною', 'набережную', 'набережной',
               'аллея', 'аллеи', 'аллею', 'аллее', 'аллеей', 'аллеею', 'мост', 'моста', 'мостом', 'мосте', 'мосту',
               'ул.', 'пер.', 'пр-д', 'пл.', 'мкр.', 'пр-т', 'т.', 'б-р', 'наб.', 'алл.', 'м.'],
    'HOUSE': [],
    'O': [],
}

REPLACEMENT_MAP = {
    'STREET': [('улица', 'ул.'), ('переулок', 'пер.'), ('проезд', 'пр-д'), ('площадь', 'пл.'), ('микрорайон', 'мкр.'),
               ('проспект', 'пр-т'), ('тупик', 'т.'), ('бульвар', 'б-р'), ('набережная', 'наб.'), ('аллея', 'алл.'),
               ('мост', 'м.')]
}

TRANSFORMATION_CASES = (
    ['orig', 'orig_lowercase', 'orig_uppercase', 'transliterated', 'transliterated_lowercase', 'transliterated_uppercase'],
    [0.4, 0.12, 0.12, 0.12, 0.12, 0.12],
)
